---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementLogicalFilter
source: html/b740ead8-7434-c2f1-0b42-74908d6a7d3f.htm
---
# ElementLogicalFilter Methods

Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.